Buscar https://www.markdownguide.org/cheat-sheet/

Buscar https://www.kaggle.com

# Manejador de datos
En Python, la libreria principal para manejar los datos es Pandas. Con ella podremos manejar Los DataFrames de una manera comoda y rapida.
Recordad:
- DataFrames: Es un conjunto de tados estructurados por secciones (columnas) y registros (filas)
- DataSet: Es una extracción de secciones de un DataFrames (En si, tambien es un DataFrames)

In [30]:
import pandas as pd

## Importación
Para importar los datos contenidos en un fichero, haremos uso del metodo read_<tipo>('dirección de la información')
El usado en estos apuntes es el "read_csv()". Este leerá un archivo de texto plano en la cual la primera linea es la que contituye la cabecera y los seggmentos estan separados por ";" y los registros por saltos de linea

In [31]:
datos = pd.read_csv('Datos/titanic3.csv')
datos

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

Como hemos visto en la linea anterior, podemos mostrar el contenido del nuestro DataFarme. Sin embargo, si solo queremos hacer una visual de la estructura, es mas idoneo usar el metodo head(). Este nos devolverá los 5 primeros registros.

In [5]:
datos.head() # Los 5 primeras filas (row)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

## Analisis estadistico
Para hacer un analisis estadistico rapido y sencillo, el metodo describe() nos devolvera un DataFarme con la información de las secciones que se pueden cuantificar. Es decir, las columnas numericas estarán dentro de este analisis, y no las de texto. Esto es importante tenerlo en cuenta, poque si queremos hacer un analisis de una tabla de texto, lo mas idoneo sera binarizar (trasformar las diferentes opciones de valores en valores numericos unicos. Ej: Hombre=1, Mujer=2).
Describe nos devolverá:
- Count: Recuento de registros no NaN totales. Util para saber si la serie tiene mucha falta de información.
- Mean: Media de todos los registros no NaN. Importante tenerlo en cuenta, ya que si queremos hacer un analisis mas exato puede que nos interese rellenar los registros vacios por la media de los que hay por ejemplo.
- Std: Desviación estandar. La deviación media que tiene todos los registros con respecto a la media (mean). Será un  +/-.
- Min: Nos indicará el valor minimo recogido.
- Max: Nos indicará el valor maximo recogido.
- 25-50-75%: Los percentiles (En este caso los cuartiles).

In [4]:
datos.describe() # Muestra una descripción de los campos numericos

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

## Definir cabecera
Si nuestros datos no tuvieran cabecera, en la importación inticaremos que no tiene cabecera (header=None) e inidcaremos el nombre de los segmentos

In [12]:
datosSin = pd.read_csv("titanic3.csv",header=None,names=[
    'Clase',
    'Supervivientes',
    'Nombre',
    'Sexo',
    'Edad',
    'sibsp',
    'parch',
    'Ticket',
    'precio',
    'Cabina',
    'Embarque',
    'Barco',
    'Cuerpo',
    'Destino'
    ])
datosSin

,Clase,Supervivientes,Nombre,Sexo,Edad,sibsp,parch,Ticket,precio,Cabina,Embarque,Barco,Cuerpo,Destino
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

## Tipo de valor
Si hacemos un type, veremos que tenemos un DataFrame

In [13]:
type(datosSin)

pandas.core.frame.DataFrame

## Creación de una serie
Nos puede interesar crear una serie que luego añadamos a un DataFrame. Para ello haremos uso del constructor Series().
En ella inicaremos los valores entre corchetes (pues es una colección de datos). Ademas indicaremos:
- Indice: index=[]. (No necesario, pues si no se pone el hará una indexación automatica)
- Nombre/Cabecera: name="Nombre". No es necesaria pero si recomendable si luego se añadirá a un DataFrame (Devolverá un error si se pretende unir a un DataFrame una serie sin nombre)

In [10]:
poblacion = pd.Series([345,347,310,220,600],index=[2000,2001,2002,2003,2004], name="Población")
poblacion

2000    345
2001    347
2002    310
2003    220
2004    600
Name: Población, dtype: int64

In [11]:
type(poblacion)

pandas.core.series.Series

## Crear una serie directamente en un DataFrame
Pandas nos permite crear series en DataFrame de una manera muy sencilla.
Para ello, haremos una llamada a una columna que aun no exista e indicaremos el valor que tendrá:
- DataFrame\['nuevaColumna'] = valor

In [34]:
datos['test'] = 0
datos

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,test
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,0
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,0
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,0
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,0
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,0

## Crear un DataFrame a partir de un diccionario
Podemos crear un DataFrame a partir de un diccionario de una manera similar a la serie. Haremos uso del contructor DataFarme pero en vez de entregarle una lista, le entregarémos un diccionario. 

Posteriormente podremos indicaremos el nombre de las claves del diccionario que queramos utilizar para formar el DataFarme con el atributo "column". De no indicarlo, recogerá todas las claves.

In [24]:
cumple = {
    'nombre':['Sandra','Isma','Guillermo','Graimito','Juan'],
    'sexo':['M','H','H','NaN','H'],
    'dia':[250,11,49,30,59]
}
type(cumple)

dict

In [25]:
datos1 = pd.DataFrame(cumple,columns=['nombre','sexo'])
datos1

      nombre sexo
0     Sandra    M
1       Isma    H
2  Guillermo    H
3   Graimito  NaN
4       Juan    H

## Seleccionar columna
Para seleccionar una columna podremos hacerlo mediante el uso de corchetes y dentro indicar el nombre de la columna entre comillas, o llamarlo como atributo del DataFrame (mas recomendado)
- DataFrame\['columna']
- DataFrame.columna

Este nos devolverá un objeto tipo Serie con todos sus metodos como el head()

In [22]:
datos1['nombre']
datos1.nombre

0       Sandra
1         Isma
2    Guillermo
3     Graimito
4         Juan
Name: nombre, dtype: object

In [24]:
type(datos.age)

pandas.core.series.Series

In [22]:
datos.name.head()

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

### Seleeción multiple
Podemos hacer una selección multiple. Para ello hacemos la "llamada" a la función de selección con los corchetes y dentro le pasaremos una lista con los nombre de las columnas, por tanto con otros corchetes
- DataFrame\[\['columna1','columna2']]

En este caso, nos devolverá un DataFrame

In [33]:
datos[['name','age']]

                                                 name      age
0                       Allen, Miss. Elisabeth Walton  29.0000
1                      Allison, Master. Hudson Trevor   0.9167
2                        Allison, Miss. Helen Loraine   2.0000
3                Allison, Mr. Hudson Joshua Creighton  30.0000
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.0000
...                                               ...      ...
1304                             Zabour, Miss. Hileni  14.5000
1305                            Zabour, Miss. Thamine      NaN
1306                        Zakarian, Mr. Mapriededer  26.5000
1307                              Zakarian, Mr. Ortin  27.0000
1308                               Zimmerman, Mr. Leo  29.0000

[1309 rows x 2 columns]


## Filtros
Para aplicar un filtro, en vez de poner el nombre de las columnas a recoger entre los corchetes aplicaremos una prueba lógica. Esta se aplicará a todas las filas y las que la cumpla serán devueltas.
- DataFrame\[ DataFrame.columna == <condición> ] (Ejemplo de aplicación)

NOTA: Si va a haber mas de una condición, es necesario englobarlos dentro de unos parentersis
- DataFrame\[ (DataFrame.columna == <condición> & DataFrame.columna2 == <condición2>) ] 

A esta idea podemos desarrollarla mas mediante la utilización de la función map junto a una función lambda. De esta manera a cada vuelta aplicaremos un mapeo a las filas en la que esta devolverá un True o False que se lo ofrecerá la función lambda. Esto nos permitirá implementar de una manera mas sencia un filtrado mas complejo.
- DataFrame\[DataFrame.columna.map(lambda nombre: nombre == <condición>)]

In [37]:
dataset = datos[['name','age','sex','survived']]

dataset[(dataset.survived == 1) & (dataset.sex == 'female')]

,name,age,sex,survived
0,"Allen, Miss. Elisabeth Walton",29.0,female,1
6,"Andrews, Miss. Kornelia Theodosia",63.0,female,1
8,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",53.0,female,1
11,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",18.0,female,1
12,"Aubart, Mme. Leontine Pauline",24.0,female,1
...,...,...,...,...
1260,"Turja, Miss. Anna Sofia",18.0,female,1
1261,"Turkula, Mrs. (Hedwig)",63.0,female,1
1286,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",38.0,female,1
1290,"Wilkes, Mrs. James (Ellen Needs)",47.0,female,1
1300,"Yasbeck, Mrs. Antoni (Selini Alexander)",15.0,female,1

In [9]:
datos[datos.name.map(lambda name: 'Mr' in name)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

# Numpy
Es la libreria principal de numero que pose Python
Con el podremos por ejemplo crear columnas vacias ya que tiene la opción de devolvernos valores vacios (NaN)

In [35]:


import pandas as pd
import numpy as np


movies = pd.read_csv("Datos/movie_metadata.csv")
movies.describe()

,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_1_facebook_likes,gross,num_voted_users,cast_total_facebook_likes,facenumber_in_poster,num_user_for_reviews,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
count,4993.000000,5028.000000,4939.000000,5020.000000,5036.000000,4.159000e+03,5.043000e+03,5043.000000,5030.000000,5022.000000,4.551000e+03,4935.000000,5030.000000,5043.000000,4714.000000,5043.000000
mean,140.194272,107.201074,686.509212,645.009761,6560.047061,4.846841e+07,8.366816e+04,9699.063851,1.371173,272.770808,3.975262e+07,2002.470517,1651.754473,6.442138,2.220403,7525.964505
std,121.601675,25.197441,2813.328607,1665.041728,15020.759120,6.845299e+07,1.384853e+05,18163.799124,2.013576,377.982886,2.061149e+08,12.474599,4042.438863,1.125116,1.385113,19320.445110
min,1.000000,7.000000,0.000000,0.000000,0.000000,1.620000e+02,5.000000e+00,0.000000,0.000000,1.000000,2.180000e+02,1916.000000,0.000000,1.600000,1.180000,0.000000
25%,50.000000,93.000000,7.000000,133.000000,614.000000,5.340988e+06,8.593500e+03,1411.000000,0.000000,65.000000,6.000000e+06,1999.000000,281.000000,5.800000,1.850000,0.000000
50%,110.000000,103.000000,49.000000,371.500000,988.000000,2.551750e+07,3.435900e+04,3090.000000,1.000000,156.000000,2.000000e+07,2005.000000,595.000000,6.600000,2.350000,166.000000
75%,195.000000,118.000000,194.500000,636.000000,11000.000000,6.230944e+07,9.630900e+04,13756.500000,2.000000,326.000000,4.500000e+07,2011.000000,918.000000,7.200000,2.350000,3000.000000
max,813.000000,511.000000,23000.000000,23000.000000,640000.000000,7.605058e+08,1.689764e+06,656730.000000,43.000000,5060.000000,1.221550e+10,2016.000000,137000.000000,9.500000,16.000000,349000.000000

In [36]:
movies['vacia'] = np.nan # Creamos una serie (columna)
movies

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes,vacia
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000,NaN
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0,NaN
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000,NaN
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000,NaN
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84,NaN
5039,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000,NaN
5040,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16,NaN
5041,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660,NaN
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456,NaN

## isnull()
Este metodo nos permite saber si dentro de una serie hay o no registros vacios (NaN). Esta nos devolverá a cada registro el un True si es NaN o False si no esta vacia. A esta salida le podemos aplicar all(), any() o sum() por ejemplo:
- isnull().all(): Nos indicara si todos los registros de la serie/columna esta vacia, es decir, si la columna no tiene registros
- isnull().any(): Nos indica si al menos algun registro tiene un valor vacio

In [3]:
test = movies.color.isnull().all() # Toda la columna esta vacía
print(test)
movies.color.isnull().any() # Algún registro esta vacío

False

True

### Porcentaje de registro vacios
Aplicando lo aprendido con isnull, podremos sacar el porcentaje de los registros vacios de una manera sencilla. A la salida de isnull que nos devolverá a cada registro si es o no NaN lo sumamos (True es 1 y False es 0, por lo tanto cuanto mas NaN mas alto será el sumatorio). Esto nos devolverá el numero total de registros vacios, aplicando la división con el numero total de registro ya obtendriamos el porcentaje (aplicando *100)

In [18]:
# Obtenemos el porcentaje de los campos vacios que tienen las diferentes columnas
round(movies.isnull().sum()/len(movies)*100,2)

color                         0.38
director_name                 2.06
num_critic_for_reviews        0.99
duration                      0.30
director_facebook_likes       2.06
actor_3_facebook_likes        0.46
actor_2_name                  0.26
actor_1_facebook_likes        0.14
gross                        17.53
genres                        0.00
actor_1_name                  0.14
movie_title                   0.00
num_voted_users               0.00
cast_total_facebook_likes     0.00
actor_3_name                  0.46
facenumber_in_poster          0.26
plot_keywords                 3.03
movie_imdb_link               0.00
num_user_for_reviews          0.42
language                      0.24
country                       0.10
content_rating                6.01
budget                        9.76
title_year                    2.14
actor_2_facebook_likes        0.26
imdb_score                    0.00
aspect_ratio                  6.52
movie_facebook_likes          0.00
dtype: float64

## ¿Existe la columna?
El atributo columns de un DataFrame almacena una lista con todos los nombre de las series/columnas. Por tanto, si aplicamos a esta el operador "in" junto el nombre de la columna que buscamos nos indicará si esa tabla existe o no

In [4]:
'vacia' in movies.columns # Existe la columna?

True

## dropna() y drop()
Metodo importante!. Este nos permite borrar los valores vacios de nuestro DataFarme. Para ello tenemos varios atributos con los que controlar el eliminado:
- Axis: Indicaremos que vamos a borrar, si columnas (axis=1) o filas (axis=0, por defecto)
- How: La condición de borrado, borrar si algun registro está vacio (how='any') o solo borrar si toda la columna o fila esté vacia (how='all', por defecto)
- Thresh: Será a sustitución del how una condicion de borrado mas profunda. En ella indicaremos el numero minimo de columnas que deben de contener valores NO vacios para NO ser borrado. Si indicamos 5, significa que el registro debe de al menos tener 5 registros con valores para no ser borrado
- Inplace: Indicaremos si queremos que el borrado se guarde en el DataFarme. Por defecto es False, por lo tanto, si queremos conservar el resultado del borrado deberemos de guardar la salida de la función en una variable. Si es True no hara falta eso ya que el borrado se aplicará directamente al DataFarme al que se llamó.


drop() es muy similar, solo que en el debemos decirle nosotros que columnas queremos borrar (entre corchetes, será una lista)
- DataFarme.drop(\['columna1','columna2'],axis=1)

In [ ]:
# Esta ejecución suele ser la primera. Eliminará las filas que no contenga nada
movies.dropna(how="all")

In [12]:
# dropna elimina los que son NaN. En nuestro caso elimina las columnas (axis=1) y con la condición de que alguna sea NaN (how='any')
movies.dropna(axis=1,how='any').head()

,genres,movie_title,num_voted_users,cast_total_facebook_likes,movie_imdb_link,imdb_score,movie_facebook_likes
0,Action|Adventure|Fantasy|Sci-Fi,Avatar,886204,4834,http://www.imdb.com/title/tt0499549/?ref_=fn_t...,7.9,33000
1,Action|Adventure|Fantasy,Pirates of the Caribbean: At World's End,471220,48350,http://www.imdb.com/title/tt0449088/?ref_=fn_t...,7.1,0
2,Action|Adventure|Thriller,Spectre,275868,11700,http://www.imdb.com/title/tt2379713/?ref_=fn_t...,6.8,85000
3,Action|Thriller,The Dark Knight Rises,1144337,106759,http://www.imdb.com/title/tt1345836/?ref_=fn_t...,8.5,164000
4,Documentary,Star Wars: Episode VII - The Force Awakens ...,8,143,http://www.imdb.com/title/tt5289954/?ref_=fn_t...,7.1,0

In [14]:
# En este caso, se borran las columnas que todos sus registros sean NaN (all) y lo guardamos en el DataFrame (inplace=True)
movies.dropna(axis=1,how='all',inplace=True)
movies

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
5039,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
5040,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
5041,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

### Borrado selectivo
Podemos combinar la función isnull() con la drop() para poder hacer un borrado mas complejo
En este ejemplo nosotros obtenemos las columnas que cumpla la condición de que el porcentaje de registros vacios sea mayor del 5%. Estas columnas se lo entregamos a la función drop para que las borre

In [21]:
# Para un borrado selectivo de unas columnas que cumpla la condición de que sus registros superan el 5% 

depurado = movies.columns[movies.isnull().sum()/len(movies)*100 > 5]

movies.drop(depurado, axis=1).head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,genres,actor_1_name,...,facenumber_in_poster,plot_keywords,movie_imdb_link,num_user_for_reviews,language,country,title_year,actor_2_facebook_likes,imdb_score,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,Action|Adventure|Fantasy|Sci-Fi,CCH Pounder,...,0.0,avatar|future|marine|native|paraplegic,http://www.imdb.com/title/tt0499549/?ref_=fn_t...,3054.0,English,USA,2009.0,936.0,7.9,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,Action|Adventure|Fantasy,Johnny Depp,...,0.0,goddess|marriage ceremony|marriage proposal|pi...,http://www.imdb.com/title/tt0449088/?ref_=fn_t...,1238.0,English,USA,2007.0,5000.0,7.1,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,Action|Adventure|Thriller,Christoph Waltz,...,1.0,bomb|espionage|sequel|spy|terrorist,http://www.imdb.com/title/tt2379713/?ref_=fn_t...,994.0,English,UK,2015.0,393.0,6.8,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,Action|Thriller,Tom Hardy,...,0.0,deception|imprisonment|lawlessness|police offi...,http://www.imdb.com/title/tt1345836/?ref_=fn_t...,2701.0,English,USA,2012.0,23000.0,8.5,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,Documentary,Doug Walker,...,0.0,NaN,http://www.imdb.com/title/tt5289954/?ref_=fn_t...,NaN,NaN,NaN,NaN,12.0,7.1,0

In [22]:
# Eliminará las filas que tengan 3 o mas datos vacios
# En nuestro caso decimos que debe tener al menos todas menos 3, es decir, que si tiene 3 o mas datos vacios, esa fila se borrará
movies.dropna(thresh=len(movies.columns)-3).head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
5,Color,Andrew Stanton,462.0,132.0,475.0,530.0,Samantha Morton,640.0,73058679.0,Action|Adventure|Sci-Fi,...,738.0,English,USA,PG-13,263700000.0,2012.0,632.0,6.6,2.35,24000

## Fillna
Nos permite rellenar aquellos datos que no contenga información (NaN). Por lo general sera un valor por defecto

In [26]:
# Con fillna podemos llenar los registros vacios con un valor por defectos
len(movies.color[movies.color.isnull()]) # Contar los vacios
movies.color = movies.color.fillna("color")
movies

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,color,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
5039,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
5040,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
5041,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [30]:
# Pero podemos rellenarlo con un valor medio
movies.director_facebook_likes = movies.director_facebook_likes.fillna(movies.director_facebook_likes.mean())

movies

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.000000,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.000000,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.000000,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.000000,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,color,Doug Walker,NaN,NaN,131.000000,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Color,Scott Smith,1.0,87.0,2.000000,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
5039,Color,NaN,43.0,43.0,686.509212,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
5040,Color,Benjamin Roberds,13.0,76.0,0.000000,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
5041,Color,Daniel Hsia,14.0,100.0,0.000000,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
5042,Color,Jon Gunn,43.0,90.0,16.000000,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

## dtypes
Este atributo contiene los tipos de valores que se a asociados a las diferentes columnas de un DataFrame. Object suele ser los tipo str

In [37]:
movies.dtypes

color                         object
director_name                 object
num_critic_for_reviews       float64
duration                     float64
director_facebook_likes      float64
actor_3_facebook_likes       float64
actor_2_name                  object
actor_1_facebook_likes       float64
gross                        float64
genres                        object
actor_1_name                  object
movie_title                   object
num_voted_users                int64
cast_total_facebook_likes      int64
actor_3_name                  object
facenumber_in_poster         float64
plot_keywords                 object
movie_imdb_link               object
num_user_for_reviews         float64
language                      object
country                       object
content_rating                object
budget                       float64
title_year                   float64
actor_2_facebook_likes       float64
imdb_score                   float64
aspect_ratio                 float64
movie_facebook_likes           int64
vacia                        float64
dtype: object

## Conversión de tipos
Mediante el metodo astype('<tipo>') podemos castear un tipo de valor asociado a una columna a otro. Resulta util si tenemos una columna que por logica solo puede ser numero enteros pero el programa lo ha asociado con un tipo Float

In [38]:
movies.num_user_for_reviews = movies.num_user_for_reviews.fillna(0)
movies.num_user_for_reviews = movies.num_user_for_reviews.astype('int')
movies.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes,vacia
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000,NaN
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0,NaN
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000,NaN
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000,NaN
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0,NaN

## unique()
Asociado a una columna nos muestra todos los diferentes valores que aparece

In [34]:
# Nos muestra las diferences valores que aparece en una columna
movies.color.unique()

array(['Color', 'color', ' Black and White'], dtype=object)

## get_dummies
Este metodo de la libreria nos permite obtener de una columna sus datos separados por sus valores. Es decir, obtendremos de una Serie un DataFrame en la cual las columnas serán los diferentes valores que contenia la serie y su contenido estará constituido por 0 y 1, siendo 0 ausencia del valor indicada por la columna y 1 presencia de ese valor. Por tanto, en cada fila solo habra un 1.

Esta funcionalidad sera muy interesante para la binarización ya que nos permitirá aplicar estudios estadisticos a columnas a las que no se les podia aplicar por ser tipo str.

In [40]:
# get_dummies es una codificacion para coger datos torpes. Pone todos los datos y lo pone en lista
colores = pd.get_dummies(movies.color)
colores

        Black and White        Color        color
count       5043.000000  5043.000000  5043.000000
mean           0.041444     0.954789     0.003768
std            0.199334     0.207788     0.061271
min            0.000000     0.000000     0.000000
25%            0.000000     1.000000     0.000000
50%            0.000000     1.000000     0.000000
75%            0.000000     1.000000     0.000000
max            1.000000     1.000000     1.000000

## Join()
Metodo que nos permite unir 2 DataFrame

In [41]:
# Borramos la columna color y unimos la columnas obtenidas del get_dummies
movies.drop(['color'],inplace=True, axis=1)
movies = movies.join(colores)
movies

,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,actor_1_name,...,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes,Black and White,Color,color
0,James Cameron,723.0,178.0,0.000000,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,CCH Pounder,...,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000,0,1,0
1,Gore Verbinski,302.0,169.0,563.000000,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,Johnny Depp,...,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0,0,1,0
2,Sam Mendes,602.0,148.0,0.000000,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,Christoph Waltz,...,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000,0,1,0
3,Christopher Nolan,813.0,164.0,22000.000000,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,Tom Hardy,...,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000,0,1,0
4,Doug Walker,NaN,NaN,131.000000,NaN,Rob Walker,131.0,NaN,Documentary,Doug Walker,...,NaN,NaN,NaN,12.0,7.1,NaN,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Scott Smith,1.0,87.0,2.000000,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,Eric Mabius,...,NaN,NaN,2013.0,470.0,7.7,NaN,84,0,1,0
5039,NaN,43.0,43.0,686.509212,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,Natalie Zea,...,TV-14,NaN,NaN,593.0,7.5,16.00,32000,0,1,0
5040,Benjamin Roberds,13.0,76.0,0.000000,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,Eva Boehnke,...,NaN,1400.0,2013.0,0.0,6.3,NaN,16,0,1,0
5041,Daniel Hsia,14.0,100.0,0.000000,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,Alan Ruck,...,PG-13,NaN,2012.0,719.0,6.3,2.35,660,0,1,0
5042,Jon Gunn,43.0,90.0,16.000000,16.0,Brian Herzlinger,86.0,85222.0,Documentary,John August,...,PG,1100.0,2004.0,23.0,6.6,1.85,456,0,1,0